Tekla.Structures.Dialog.UIControls.MeshSelectionForm
The MeshSelectionForm class represents a dialog to select meshes
using the mesh catalog.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.MeshItem})
Creates a new instance of the MeshSelectionForm.
MeshList: A list with the meshes that will be added to the tree.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.MeshItem},System.String,System.String)
Creates a new instance of the MeshSelectionForm and will select in the tree
the mesh that contains the given parameters (if possible).
MeshList: A list with the meshes that will be added to the tree.
StartingMesh: The name of the mesh to be selected.
StartingGrade: The grade of the mesh to be selected.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.OnLoad(System.EventArgs)
When the load event is raised, the tree in the dialog is filled with the rebars.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
E: The event arguments.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.SelectedMeshName
The selected mesh name.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.SelectedMeshGrade
The selected mesh grade.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.CreateNodeIfNeeded(Tekla.Structures.Catalogs.MeshItem,System.Int32)
Creates new nodes in the tree for names of the meshes.
Item: MeshItem that is going to be added to the tree if needed.
NodeType: NodeType grade or name of the mesh to be added to the tree.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.CancelClicked(System.Object,System.EventArgs)
When Cancel button is clicked dialog is closed and not rebar is returned.
Sender:
E:

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.OkClicked(System.Object,System.EventArgs)
When Ok button is clicked dialog is closed and select rebar is returned.
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.SetDistanceListAttributeValue(System.Windows.Forms.Control,System.String)
Set distance list attribute value.
Remarks:
The DistanceListConverter assumes current units when converting while TS default units is mm.
In order not to break API override with proper conversion.
Ctrl: The control to change value for.
Value: Value to set.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.MeshSelectionForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.